; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::rt::Argument<'_>" = type { %"core::fmt::rt::ArgumentType<'_>" }
%"core::fmt::rt::ArgumentType<'_>" = type { [1 x i64], ptr }

@alloc_83ea17bf0c4f4a5a5a13d3ae7955acd0 = private unnamed_addr constant <{ [4 x i8] }> zeroinitializer, align 4
@alloc_e66071d94605838e7dc5950cdad7bb3a = private unnamed_addr constant <{ [4 x i8] }> <{ [4 x i8] c"\16\00\00\00" }>, align 4
@alloc_1b3804a15076ee773e353053d7e3ff90 = private unnamed_addr constant <{ [72 x i8] }> <{ [72 x i8] c"/home/zjac281/Desktop/RustMC/rust/library/std/src/sys/pal/unix/thread.rs" }>, align 1
@alloc_b6ccc1f9f1537e7e6d3c84e4ab130d69 = private unnamed_addr constant <{ ptr, [16 x i8] }> <{ ptr @alloc_1b3804a15076ee773e353053d7e3ff90, [16 x i8] c"H\00\00\00\00\00\00\00\\\00\00\00\09\00\00\00" }>, align 8
@alloc_1344f57768feaf6780907812b147bc1c = private unnamed_addr constant <{ ptr, [16 x i8] }> <{ ptr @alloc_1b3804a15076ee773e353053d7e3ff90, [16 x i8] c"H\00\00\00\00\00\00\00S\00\00\00\15\00\00\00" }>, align 8
@alloc_72ca3e93846fc2f65b7d23a91f1c092a = private unnamed_addr constant <{ ptr, [16 x i8] }> <{ ptr @alloc_1b3804a15076ee773e353053d7e3ff90, [16 x i8] c"H\00\00\00\00\00\00\00K\00\00\00\15\00\00\00" }>, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::thread::{impl#1}::spawn_unchecked_::{closure_env#0}<racy_test::main::{closure_env#0}, ()> as core::ops::function::FnOnce<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<std::thread::{impl#1}::spawn_unchecked_::{closure_env#0}<racy_test::main::{closure_env#0}, ()> as core::ops::function::FnOnce<()>>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !27, identifier: "75bfe59aa275246878340fce5e52b69")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<racy_test::main::{closure_env#0}, ()>", scope: !13, file: !2, size: 128, align: 64, elements: !17, templateParams: !27, identifier: "3fe0c75ee06bbbf38c932d760589ca8")
!13 = !DINamespace(name: "spawn_unchecked_", scope: !14)
!14 = !DINamespace(name: "{impl#1}", scope: !15)
!15 = !DINamespace(name: "thread", scope: !16)
!16 = !DINamespace(name: "std", scope: null)
!17 = !{!18, !141, !160}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "output_capture", scope: !12, file: !2, baseType: !19, size: 64, align: 64, offset: 64)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>, alloc::alloc::Global>>", scope: !20, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !22, templateParams: !27, identifier: "8c5b16f077ba0b4c2bfe606c436a4af1")
!20 = !DINamespace(name: "option", scope: !21)
!21 = !DINamespace(name: "core", scope: null)
!22 = !{!23}
!23 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !19, file: !2, size: 64, align: 64, elements: !24, templateParams: !27, identifier: "e74abf11372049352360e7a52819bb9", discriminator: !139)
!24 = !{!25, !135}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !23, file: !2, baseType: !26, size: 64, align: 64, extraData: i128 0)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !19, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !28, identifier: "663f6f534fa9f1ba4070a89e30ba288b")
!27 = !{}
!28 = !{!29}
!29 = !DITemplateTypeParameter(name: "T", type: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>, alloc::alloc::Global>", scope: !31, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !33, templateParams: !134, identifier: "aba4c2a902a34fcd586450652c899589")
!31 = !DINamespace(name: "sync", scope: !32)
!32 = !DINamespace(name: "alloc", scope: null)
!33 = !{!34, !131, !133}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !30, file: !2, baseType: !35, size: 64, align: 64, flags: DIFlagPrivate)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>>", scope: !36, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !38, templateParams: !129, identifier: "ea19a134307a45cfe158b125ddad1396")
!36 = !DINamespace(name: "non_null", scope: !37)
!37 = !DINamespace(name: "ptr", scope: !21)
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !35, file: !2, baseType: !40, size: 64, align: 64, flags: DIFlagPrivate)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>", baseType: !41, size: 64, align: 64, dwarfAddressSpace: 0)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>", scope: !31, file: !2, size: 384, align: 64, flags: DIFlagPrivate, elements: !42, templateParams: !127, identifier: "c9c0829733173cb436884d8405ce8cf7")
!42 = !{!43, !55, !56}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !41, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagPrivate)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !45, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !47, templateParams: !27, identifier: "40c3b14869e54307496845be78cb239")
!45 = !DINamespace(name: "atomic", scope: !46)
!46 = !DINamespace(name: "sync", scope: !21)
!47 = !{!48}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !44, file: !2, baseType: !49, size: 64, align: 64, flags: DIFlagPrivate)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !50, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !51, templateParams: !53, identifier: "ac5365b6794c311592c6292b8fcc4c05")
!50 = !DINamespace(name: "cell", scope: !21)
!51 = !{!52}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !49, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!53 = !{!54}
!54 = !DITemplateTypeParameter(name: "T", type: !9)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !41, file: !2, baseType: !44, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !41, file: !2, baseType: !57, size: 256, align: 64, offset: 128, flags: DIFlagPrivate)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>", scope: !58, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !60, templateParams: !125, identifier: "1fd21dcf13eef27ca1afcad34bc32b5")
!58 = !DINamespace(name: "mutex", scope: !59)
!59 = !DINamespace(name: "sync", scope: !16)
!60 = !{!61, !78, !92}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !57, file: !2, baseType: !62, size: 32, align: 32, flags: DIFlagPrivate)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !63, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !67, templateParams: !27, identifier: "8a9179f0932cd364f505165948f81ab")
!63 = !DINamespace(name: "futex", scope: !64)
!64 = !DINamespace(name: "mutex", scope: !65)
!65 = !DINamespace(name: "sync", scope: !66)
!66 = !DINamespace(name: "sys", scope: !16)
!67 = !{!68}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !62, file: !2, baseType: !69, size: 32, align: 32, flags: DIFlagPrivate)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU32", scope: !45, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !70, templateParams: !27, identifier: "8f638c666de45234d628b96937f84e5c")
!70 = !{!71}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !69, file: !2, baseType: !72, size: 32, align: 32, flags: DIFlagPrivate)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u32>", scope: !50, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !73, templateParams: !76, identifier: "b69735b31342b6d89cd4923396de3f6")
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !72, file: !2, baseType: !75, size: 32, align: 32, flags: DIFlagPrivate)
!75 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!76 = !{!77}
!77 = !DITemplateTypeParameter(name: "T", type: !75)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !57, file: !2, baseType: !79, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !80, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !81, templateParams: !27, identifier: "177a650d4eafb6f4b8f54e15c59a89c0")
!80 = !DINamespace(name: "poison", scope: !59)
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !79, file: !2, baseType: !83, size: 8, align: 8, flags: DIFlagPrivate)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !45, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !84, templateParams: !27, identifier: "9dc5f71291b03569ded2bf488c693b03")
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !83, file: !2, baseType: !86, size: 8, align: 8, flags: DIFlagPrivate)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !50, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !87, templateParams: !90, identifier: "aaba1e1583a6e8433630b8d3230e5a0e")
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !86, file: !2, baseType: !89, size: 8, align: 8, flags: DIFlagPrivate)
!89 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!90 = !{!91}
!91 = !DITemplateTypeParameter(name: "T", type: !89)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !57, file: !2, baseType: !93, size: 192, align: 64, offset: 64, flags: DIFlagPrivate)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<alloc::vec::Vec<u8, alloc::alloc::Global>>", scope: !50, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !94, templateParams: !125, identifier: "c86b3bd7492bb218447a7f1f67391d3e")
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !93, file: !2, baseType: !96, size: 192, align: 64, flags: DIFlagPrivate)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !97, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !98, templateParams: !122, identifier: "42a6b7b444c31d90972600c87bef4c46")
!97 = !DINamespace(name: "vec", scope: !32)
!98 = !{!99, !124}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !96, file: !2, baseType: !100, size: 128, align: 64, flags: DIFlagPrivate)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !101, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !102, templateParams: !122, identifier: "fb832f423e34bfe02f4fed55f6982e58")
!101 = !DINamespace(name: "raw_vec", scope: !32)
!102 = !{!103, !115, !119}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !100, file: !2, baseType: !104, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !105, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !106, templateParams: !90, identifier: "4a2ddd4540db1b7a8b4778aa3d0b14ca")
!105 = !DINamespace(name: "unique", scope: !37)
!106 = !{!107, !112}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !104, file: !2, baseType: !108, size: 64, align: 64, flags: DIFlagPrivate)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !36, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !109, templateParams: !90, identifier: "b7956c1d12297ebdb50aae34f4a44380")
!109 = !{!110}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !108, file: !2, baseType: !111, size: 64, align: 64, flags: DIFlagPrivate)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !104, file: !2, baseType: !113, align: 8, offset: 64, flags: DIFlagPrivate)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !114, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !90, identifier: "ed0613dd6c08fa9e9bc56bed8dc7498a")
!114 = !DINamespace(name: "marker", scope: !21)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !100, file: !2, baseType: !116, size: 64, align: 64, flags: DIFlagPrivate)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !101, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !117, templateParams: !27, identifier: "404e3436313963c6f34204d2f1eb7ec1")
!117 = !{!118}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !116, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !100, file: !2, baseType: !120, align: 8, offset: 128, flags: DIFlagPrivate)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !121, file: !2, align: 8, flags: DIFlagPublic, elements: !27, identifier: "46e1f56ff6128cb246bca40e3e62e71a")
!121 = !DINamespace(name: "alloc", scope: !32)
!122 = !{!91, !123}
!123 = !DITemplateTypeParameter(name: "A", type: !120)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !96, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!125 = !{!126}
!126 = !DITemplateTypeParameter(name: "T", type: !96)
!127 = !{!128}
!128 = !DITemplateTypeParameter(name: "T", type: !57)
!129 = !{!130}
!130 = !DITemplateTypeParameter(name: "T", type: !41)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !30, file: !2, baseType: !132, align: 8, offset: 64, flags: DIFlagPrivate)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>>", scope: !114, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !129, identifier: "36483b85f2b3b06fb679b2fa022a03f5")
!133 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !30, file: !2, baseType: !120, align: 8, offset: 64, flags: DIFlagPrivate)
!134 = !{!128, !123}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !23, file: !2, baseType: !136, size: 64, align: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !19, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !137, templateParams: !28, identifier: "3c9772275a34da9615b332a32d3193b3")
!137 = !{!138}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !136, file: !2, baseType: !30, size: 64, align: 64, flags: DIFlagPublic)
!139 = !DIDerivedType(tag: DW_TAG_member, scope: !19, file: !2, baseType: !140, size: 64, align: 64, flags: DIFlagArtificial)
!140 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !12, file: !2, baseType: !142, align: 8, offset: 128)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaybeDangling<racy_test::main::{closure_env#0}>", scope: !13, file: !2, align: 8, flags: DIFlagProtected, elements: !143, templateParams: !158, identifier: "a649dd35aaeafd5b6e60e738fc688428")
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !142, file: !2, baseType: !145, align: 8, flags: DIFlagProtected)
!145 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<racy_test::main::{closure_env#0}>", scope: !146, file: !2, align: 8, elements: !148, templateParams: !158, identifier: "d820af343ad3808e739152ed219c8340")
!146 = !DINamespace(name: "maybe_uninit", scope: !147)
!147 = !DINamespace(name: "mem", scope: !21)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !145, file: !2, baseType: !7, align: 8)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !145, file: !2, baseType: !151, align: 8)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<racy_test::main::{closure_env#0}>", scope: !152, file: !2, align: 8, flags: DIFlagPublic, elements: !153, templateParams: !158, identifier: "ea8c35b8a0e8820619365893be280569")
!152 = !DINamespace(name: "manually_drop", scope: !147)
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !151, file: !2, baseType: !155, align: 8, flags: DIFlagPrivate)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !156, file: !2, align: 8, elements: !27, identifier: "e6b2fdf142ca32e1235847a7459441ca")
!156 = !DINamespace(name: "main", scope: !157)
!157 = !DINamespace(name: "racy_test", scope: null)
!158 = !{!159}
!159 = !DITemplateTypeParameter(name: "T", type: !155)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "their_packet", scope: !12, file: !2, baseType: !161, size: 64, align: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::Packet<()>, alloc::alloc::Global>", scope: !31, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !162, templateParams: !367, identifier: "fa217771c73e99b071a18235e22be4cc")
!162 = !{!163, !364, !366}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !161, file: !2, baseType: !164, size: 64, align: 64, flags: DIFlagPrivate)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::Packet<()>>>", scope: !36, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !165, templateParams: !362, identifier: "e6e36590837ee419e2e309b916b18c52")
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !164, file: !2, baseType: !167, size: 64, align: 64, flags: DIFlagPrivate)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::Packet<()>>", baseType: !168, size: 64, align: 64, dwarfAddressSpace: 0)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::Packet<()>>", scope: !31, file: !2, size: 384, align: 64, flags: DIFlagPrivate, elements: !169, templateParams: !360, identifier: "108f166b8dbcf63ac32093920973b8a4")
!169 = !{!170, !171, !172}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !168, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagPrivate)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !168, file: !2, baseType: !44, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !168, file: !2, baseType: !173, size: 256, align: 64, offset: 128, flags: DIFlagPrivate)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Packet<()>", scope: !15, file: !2, size: 256, align: 64, flags: DIFlagPrivate, elements: !174, templateParams: !359, identifier: "c2fdc383c7ed987a6e87c45f8b3d2f1b")
!174 = !{!175, !295, !341}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !173, file: !2, baseType: !176, size: 64, align: 64, flags: DIFlagPrivate)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<std::thread::scoped::ScopeData, alloc::alloc::Global>>", scope: !20, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !177, templateParams: !27, identifier: "c9cf6b2a6da8dea6223d9527275a0710")
!177 = !{!178}
!178 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !176, file: !2, size: 64, align: 64, elements: !179, templateParams: !27, identifier: "43d07cb0bc8a37329c8c1ec56e3fa378", discriminator: !294)
!179 = !{!180, !290}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !178, file: !2, baseType: !181, size: 64, align: 64, extraData: i128 0)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !176, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !182, identifier: "4e35fa3570679a9078a872bd0913dd56")
!182 = !{!183}
!183 = !DITemplateTypeParameter(name: "T", type: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::scoped::ScopeData, alloc::alloc::Global>", scope: !31, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !185, templateParams: !289, identifier: "970cbfc10695c4b5dfcdab4c05094b09")
!185 = !{!186, !286, !288}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !184, file: !2, baseType: !187, size: 64, align: 64, flags: DIFlagPrivate)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::scoped::ScopeData>>", scope: !36, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !188, templateParams: !284, identifier: "deb8ea041c924cddfe8a24be67a7f751")
!188 = !{!189}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !187, file: !2, baseType: !190, size: 64, align: 64, flags: DIFlagPrivate)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::scoped::ScopeData>", baseType: !191, size: 64, align: 64, dwarfAddressSpace: 0)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::scoped::ScopeData>", scope: !31, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !192, templateParams: !282, identifier: "cef00f0baf258b093500ed5803e26a2")
!192 = !{!193, !194, !195}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !191, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagPrivate)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !191, file: !2, baseType: !44, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !191, file: !2, baseType: !196, size: 192, align: 64, offset: 128, flags: DIFlagPrivate)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScopeData", scope: !197, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !198, templateParams: !27, identifier: "68a4a48e727cce7ddc64661eb6db062b")
!197 = !DINamespace(name: "scoped", scope: !15)
!198 = !{!199, !200, !201}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "num_running_threads", scope: !196, file: !2, baseType: !44, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "a_thread_panicked", scope: !196, file: !2, baseType: !83, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "main_thread", scope: !196, file: !2, baseType: !202, size: 64, align: 64, flags: DIFlagPrivate)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Thread", scope: !15, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !203, templateParams: !27, identifier: "59c4f904a078fe9dae9ecf824aaaef4c")
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !202, file: !2, baseType: !205, size: 64, align: 64, flags: DIFlagPrivate)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Pin<alloc::sync::Arc<std::thread::Inner, alloc::alloc::Global>>", scope: !206, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !207, templateParams: !280, identifier: "431489aa33a6f90f1c319f59f0ea3366")
!206 = !DINamespace(name: "pin", scope: !21)
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__pointer", scope: !205, file: !2, baseType: !209, size: 64, align: 64, flags: DIFlagPublic)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::Inner, alloc::alloc::Global>", scope: !31, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !210, templateParams: !279, identifier: "b90da0ef1c1b389791a1a8d997e243f")
!210 = !{!211, !276, !278}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !209, file: !2, baseType: !212, size: 64, align: 64, flags: DIFlagPrivate)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::Inner>>", scope: !36, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !213, templateParams: !274, identifier: "b90aaad6583abfdc78a3ba5dfd087fa2")
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !212, file: !2, baseType: !215, size: 64, align: 64, flags: DIFlagPrivate)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::Inner>", baseType: !216, size: 64, align: 64, dwarfAddressSpace: 0)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::Inner>", scope: !31, file: !2, size: 448, align: 64, flags: DIFlagPrivate, elements: !217, templateParams: !272, identifier: "e5708301609118c828def7817752a2a9")
!217 = !{!218, !219, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !216, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagPrivate)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !216, file: !2, baseType: !44, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !216, file: !2, baseType: !221, size: 320, align: 64, offset: 128, flags: DIFlagPrivate)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !15, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !222, templateParams: !27, identifier: "4003ffcc941945028a5fd7912c1beb89")
!222 = !{!223, !251, !266}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !221, file: !2, baseType: !224, size: 192, align: 64, flags: DIFlagPrivate)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadName", scope: !15, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !225, templateParams: !27, identifier: "f707b00c6a674eaf540582827d304c5a")
!225 = !{!226}
!226 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !224, file: !2, size: 192, align: 64, elements: !227, templateParams: !27, identifier: "665e6d79fcee13932daf4b8cfad3cee", discriminator: !250)
!227 = !{!228, !230, !248}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Main", scope: !226, file: !2, baseType: !229, size: 192, align: 64, extraData: i128 0)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", scope: !224, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !27, identifier: "e93f3ee58adfd14bfd7fefb4137c3092")
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Other", scope: !226, file: !2, baseType: !231, size: 192, align: 64, extraData: i128 1)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Other", scope: !224, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !232, templateParams: !27, identifier: "87ec39ece8d8fe1136a1cb8d07b1693")
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !231, file: !2, baseType: !234, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadNameString", scope: !235, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !236, templateParams: !27, identifier: "508ec98266b0b87a357cb1d752febbef")
!235 = !DINamespace(name: "thread_name_string", scope: !15)
!236 = !{!237}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !234, file: !2, baseType: !238, size: 128, align: 64, flags: DIFlagPrivate)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CString", scope: !239, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !241, templateParams: !27, identifier: "290a3a1ed6fe87997a810afd2bbabbda")
!239 = !DINamespace(name: "c_str", scope: !240)
!240 = !DINamespace(name: "ffi", scope: !32)
!241 = !{!242}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !238, file: !2, baseType: !243, size: 128, align: 64, flags: DIFlagPrivate)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[u8], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !244, templateParams: !27, identifier: "8a8e2b7f86375e5e7a9085ebf82e3839")
!244 = !{!245, !247}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !243, file: !2, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !243, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Unnamed", scope: !226, file: !2, baseType: !249, size: 192, align: 64, extraData: i128 2)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Unnamed", scope: !224, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !27, identifier: "c355f8b7b6dd68a3940c490d3d1b7b9b")
!250 = !DIDerivedType(tag: DW_TAG_member, scope: !224, file: !2, baseType: !140, size: 64, align: 64, flags: DIFlagArtificial)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !221, file: !2, baseType: !252, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadId", scope: !15, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !253, templateParams: !27, identifier: "52eaeb41cd3f8c5d10e0d48bd39bfa1")
!253 = !{!254}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !252, file: !2, baseType: !255, size: 64, align: 64, flags: DIFlagPrivate)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonZero<u64>", scope: !256, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !258, templateParams: !264, identifier: "bfb139c5c9e2b22c7f87a708a1c55377")
!256 = !DINamespace(name: "nonzero", scope: !257)
!257 = !DINamespace(name: "num", scope: !21)
!258 = !{!259}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !255, file: !2, baseType: !260, size: 64, align: 64, flags: DIFlagPrivate)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroU64Inner", scope: !261, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !262, templateParams: !27, identifier: "fb47b7e7c347d9e2826242f9f07cddff")
!261 = !DINamespace(name: "private", scope: !256)
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !260, file: !2, baseType: !140, size: 64, align: 64, flags: DIFlagPrivate)
!264 = !{!265}
!265 = !DITemplateTypeParameter(name: "T", type: !140)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !221, file: !2, baseType: !267, size: 32, align: 32, offset: 256, flags: DIFlagPrivate)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Parker", scope: !268, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !270, templateParams: !27, identifier: "38a76cda34bd99ad7abb90b538056e6a")
!268 = !DINamespace(name: "futex", scope: !269)
!269 = !DINamespace(name: "thread_parking", scope: !65)
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !267, file: !2, baseType: !69, size: 32, align: 32, flags: DIFlagPrivate)
!272 = !{!273}
!273 = !DITemplateTypeParameter(name: "T", type: !221)
!274 = !{!275}
!275 = !DITemplateTypeParameter(name: "T", type: !216)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !209, file: !2, baseType: !277, align: 8, offset: 64, flags: DIFlagPrivate)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::Inner>>", scope: !114, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !274, identifier: "4c1c4eae74bd5a03c41b63d4079f7f45")
!278 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !209, file: !2, baseType: !120, align: 8, offset: 64, flags: DIFlagPrivate)
!279 = !{!273, !123}
!280 = !{!281}
!281 = !DITemplateTypeParameter(name: "Ptr", type: !209)
!282 = !{!283}
!283 = !DITemplateTypeParameter(name: "T", type: !196)
!284 = !{!285}
!285 = !DITemplateTypeParameter(name: "T", type: !191)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !184, file: !2, baseType: !287, align: 8, offset: 64, flags: DIFlagPrivate)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::scoped::ScopeData>>", scope: !114, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !284, identifier: "2bef92efd71bf351c00074e2d2ec1721")
!288 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !184, file: !2, baseType: !120, align: 8, offset: 64, flags: DIFlagPrivate)
!289 = !{!283, !123}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !178, file: !2, baseType: !291, size: 64, align: 64)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !176, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !292, templateParams: !182, identifier: "130d5cbd72975190e512595eb886156")
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !291, file: !2, baseType: !184, size: 64, align: 64, flags: DIFlagPublic)
!294 = !DIDerivedType(tag: DW_TAG_member, scope: !176, file: !2, baseType: !140, size: 64, align: 64, flags: DIFlagArtificial)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !173, file: !2, baseType: !296, size: 192, align: 64, offset: 64, flags: DIFlagPrivate)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>>>>", scope: !50, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !297, templateParams: !339, identifier: "3b391d7c94372e3fb0aa699f7f5561ee")
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !296, file: !2, baseType: !299, size: 192, align: 64, flags: DIFlagPrivate)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::result::Result<(), alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>>>", scope: !20, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !300, templateParams: !27, identifier: "4155e8f0c06c348979d78075b5750a41")
!300 = !{!301}
!301 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !299, file: !2, size: 192, align: 64, elements: !302, templateParams: !27, identifier: "7e689d2152099de287f5238162bd86ae", discriminator: !338)
!302 = !{!303, !334}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !301, file: !2, baseType: !304, size: 192, align: 64, extraData: i128 0)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !299, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !305, identifier: "ece99859b78f0275c73c03249c4f1e0a")
!305 = !{!306}
!306 = !DITemplateTypeParameter(name: "T", type: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>>", scope: !308, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !309, templateParams: !27, identifier: "2e1c61f63a34ebfe59693ed3b2abd01f")
!308 = !DINamespace(name: "result", scope: !21)
!309 = !{!310}
!310 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !307, file: !2, size: 128, align: 64, elements: !311, templateParams: !27, identifier: "eaea65cde17b34dcad9ff50535b3df85", discriminator: !333)
!311 = !{!312, !329}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !310, file: !2, baseType: !313, size: 128, align: 64, extraData: i128 0)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !307, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !314, templateParams: !316, identifier: "642737ca6f62f4adc37c5ec93f9a11e2")
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !313, file: !2, baseType: !7, align: 8, flags: DIFlagPublic)
!316 = !{!317, !318}
!317 = !DITemplateTypeParameter(name: "T", type: !7)
!318 = !DITemplateTypeParameter(name: "E", type: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !320, templateParams: !27, identifier: "331d8a6bf0afb981b87e473f66c82d5f")
!320 = !{!321, !324}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !319, file: !2, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64, dwarfAddressSpace: 0)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::any::Any + core::marker::Send)", file: !2, align: 8, elements: !27, identifier: "f10cb8f1c2908e6aaeb0e330d5d1266")
!324 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !319, file: !2, baseType: !325, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 4]", baseType: !326, size: 64, align: 64, dwarfAddressSpace: 0)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 256, align: 64, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 4, lowerBound: 0)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !310, file: !2, baseType: !330, size: 128, align: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !307, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !331, templateParams: !316, identifier: "483a95e73a3f5583e74d5136ba43daba")
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !330, file: !2, baseType: !319, size: 128, align: 64, flags: DIFlagPublic)
!333 = !DIDerivedType(tag: DW_TAG_member, scope: !307, file: !2, baseType: !140, size: 64, align: 64, flags: DIFlagArtificial)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !301, file: !2, baseType: !335, size: 192, align: 64, extraData: i128 1)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !299, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !336, templateParams: !305, identifier: "d7e6600bc0b8262bf5a54ec431148666")
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !335, file: !2, baseType: !307, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!338 = !DIDerivedType(tag: DW_TAG_member, scope: !299, file: !2, baseType: !140, size: 64, align: 64, flags: DIFlagArtificial)
!339 = !{!340}
!340 = !DITemplateTypeParameter(name: "T", type: !299)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !173, file: !2, baseType: !342, align: 8, offset: 256, flags: DIFlagPrivate)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<core::option::Option<&std::thread::scoped::ScopeData>>", scope: !114, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !343, identifier: "a1ea62f068ae86528adc494e1c00e4c0")
!343 = !{!344}
!344 = !DITemplateTypeParameter(name: "T", type: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&std::thread::scoped::ScopeData>", scope: !20, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !346, templateParams: !27, identifier: "f989c46f71bb3d1ff1f3b95d32133784")
!346 = !{!347}
!347 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !345, file: !2, size: 64, align: 64, elements: !348, templateParams: !27, identifier: "ecd0c5ae8eac647fd26230400a8ffe78", discriminator: !358)
!348 = !{!349, !354}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !347, file: !2, baseType: !350, size: 64, align: 64, extraData: i128 0)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !345, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !351, identifier: "8f7330d4d61ff02e898eeb0a0baca74b")
!351 = !{!352}
!352 = !DITemplateTypeParameter(name: "T", type: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::thread::scoped::ScopeData", baseType: !196, size: 64, align: 64, dwarfAddressSpace: 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !347, file: !2, baseType: !355, size: 64, align: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !345, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !356, templateParams: !351, identifier: "c3a7652931ce775d95ba0db13cdd6dcb")
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !355, file: !2, baseType: !353, size: 64, align: 64, flags: DIFlagPublic)
!358 = !DIDerivedType(tag: DW_TAG_member, scope: !345, file: !2, baseType: !140, size: 64, align: 64, flags: DIFlagArtificial)
!359 = !{!317}
!360 = !{!361}
!361 = !DITemplateTypeParameter(name: "T", type: !173)
!362 = !{!363}
!363 = !DITemplateTypeParameter(name: "T", type: !168)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !161, file: !2, baseType: !365, align: 8, offset: 64, flags: DIFlagPrivate)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::Packet<()>>>", scope: !114, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !362, identifier: "d9bc20149c5c11b03de70da0552a24e8")
!366 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !161, file: !2, baseType: !120, align: 8, offset: 64, flags: DIFlagPrivate)
!367 = !{!361, !123}
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "<std::io::error::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !370, isLocal: true, isDefinition: true)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<std::io::error::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !371, vtableHolder: !376, templateParams: !27, identifier: "e4808d1ef640817646b1d33f3d4cf919")
!371 = !{!372, !373, !374, !375}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !370, file: !2, baseType: !6, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !370, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !370, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !370, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !377, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !379, templateParams: !27, identifier: "b0d760b44882b965d01d7ce1cd4c2ee1")
!377 = !DINamespace(name: "error", scope: !378)
!378 = !DINamespace(name: "io", scope: !16)
!379 = !{!380}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !376, file: !2, baseType: !381, size: 64, align: 64, flags: DIFlagPrivate)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !382, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !383, templateParams: !27, identifier: "34a6e6936e768bfb9cdbbc46745913")
!382 = !DINamespace(name: "repr_bitpacked", scope: !377)
!383 = !{!384, !388}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !381, file: !2, baseType: !385, size: 64, align: 64, flags: DIFlagPrivate)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !36, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !386, templateParams: !359, identifier: "b78d38b287c182af78f6485e4ab2041d")
!386 = !{!387}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !385, file: !2, baseType: !6, size: 64, align: 64, flags: DIFlagPrivate)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !381, file: !2, baseType: !389, align: 8, offset: 64, flags: DIFlagPrivate)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::io::error::ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>>", scope: !114, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !390, identifier: "dfd3e6cee13cb57cce7cf08dd924671f")
!390 = !{!391}
!391 = !DITemplateTypeParameter(name: "T", type: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>", scope: !377, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !393, templateParams: !27, identifier: "869f9b0cbde79b643d2e665a0589ebec")
!393 = !{!394}
!394 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !392, file: !2, size: 128, align: 64, elements: !395, templateParams: !27, identifier: "98fcf5897beb9db654af9364a0a4a52b", discriminator: !482)
!395 = !{!396, !461, !465, !478}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !394, file: !2, baseType: !397, size: 128, align: 64, extraData: i128 0)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !392, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !398, templateParams: !401, identifier: "87c4594c1fdf3abff3babf0bf15dc2c9")
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !397, file: !2, baseType: !400, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!400 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!401 = !{!402}
!402 = !DITemplateTypeParameter(name: "C", type: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !404, size: 64, align: 64, dwarfAddressSpace: 0)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !377, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !405, templateParams: !27, identifier: "ee9f6565955a1fd6c1e58cdee56b0df9")
!405 = !{!406, !450}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !404, file: !2, baseType: !407, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!407 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !377, file: !2, baseType: !89, size: 8, align: 8, flags: DIFlagEnumClass, elements: !408)
!408 = !{!409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449}
!409 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!410 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!411 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!412 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!413 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!414 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!415 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!416 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!417 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!418 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!419 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!420 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!421 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!422 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!423 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!424 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!425 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!426 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!427 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!428 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!429 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!430 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!431 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!432 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!433 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!434 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!435 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26, isUnsigned: true)
!436 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!437 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!438 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!439 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!440 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!441 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!442 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!443 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!444 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!445 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!446 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!447 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!448 = !DIEnumerator(name: "Other", value: 39, isUnsigned: true)
!449 = !DIEnumerator(name: "Uncategorized", value: 40, isUnsigned: true)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !404, file: !2, baseType: !451, size: 128, align: 64, flags: DIFlagPrivate)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !452, templateParams: !27, identifier: "4c4bc2acc63c3a973bdce18064b75774")
!452 = !{!453, !456}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !451, file: !2, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64, dwarfAddressSpace: 0)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !27, identifier: "467f94f9cb1fb6a8769bbb9efef33b9c")
!456 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !451, file: !2, baseType: !457, size: 64, align: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 10]", baseType: !458, size: 64, align: 64, dwarfAddressSpace: 0)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 640, align: 64, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 10, lowerBound: 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !394, file: !2, baseType: !462, size: 128, align: 64, extraData: i128 1)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !392, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !463, templateParams: !401, identifier: "160ff0667df7d9d65729dd41c8023bdc")
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !462, file: !2, baseType: !407, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !394, file: !2, baseType: !466, size: 128, align: 64, extraData: i128 2)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !392, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !467, templateParams: !401, identifier: "d67be6cf070060f1d2c4878c55139386")
!467 = !{!468}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !466, file: !2, baseType: !469, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::io::error::SimpleMessage", baseType: !470, size: 64, align: 64, dwarfAddressSpace: 0)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !377, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !471, templateParams: !27, identifier: "547a67f2ad6c7e3a1b38ed068c01fe46")
!471 = !{!472, !473}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !470, file: !2, baseType: !407, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !470, file: !2, baseType: !474, size: 128, align: 64, flags: DIFlagPrivate)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !475, templateParams: !27, identifier: "9277eecd40495f85161460476aacc992")
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !474, file: !2, baseType: !246, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !474, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !394, file: !2, baseType: !479, size: 128, align: 64, extraData: i128 3)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !392, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !480, templateParams: !401, identifier: "a0b672df842f19ef7304b59535d2bc7b")
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !479, file: !2, baseType: !403, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!482 = !DIDerivedType(tag: DW_TAG_member, scope: !392, file: !2, baseType: !89, size: 8, align: 8, flags: DIFlagArtificial)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "<std::thread::local::AccessError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !485, isLocal: true, isDefinition: true)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<std::thread::local::AccessError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !486, vtableHolder: !491, templateParams: !27, identifier: "4c826555d76c7863a9b20da6c9642a04")
!486 = !{!487, !488, !489, !490}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !485, file: !2, baseType: !6, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !485, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !485, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !485, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AccessError", scope: !492, file: !2, align: 8, flags: DIFlagPublic, elements: !27, identifier: "36e1c54d559196d38ce2976910964f59")
!492 = !DINamespace(name: "local", scope: !15)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "<core::alloc::layout::LayoutError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !495, isLocal: true, isDefinition: true)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<core::alloc::layout::LayoutError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !496, vtableHolder: !501, templateParams: !27, identifier: "238c2953ed040b6141fdc54f854a9a9f")
!496 = !{!497, !498, !499, !500}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !495, file: !2, baseType: !6, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !495, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !495, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !495, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LayoutError", scope: !502, file: !2, align: 8, flags: DIFlagPublic, elements: !27, identifier: "c83a047462cb99d211fb9da055753981")
!502 = !DINamespace(name: "layout", scope: !503)
!503 = !DINamespace(name: "alloc", scope: !21)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !506, isLocal: true, isDefinition: true)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !507, vtableHolder: !512, templateParams: !27, identifier: "76a4cc7437dd87f24f5f19a9dbd2f80")
!507 = !{!508, !509, !510, !511}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !506, file: !2, baseType: !6, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !506, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !506, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !506, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !400, size: 64, align: 64, dwarfAddressSpace: 0)
!513 = !{!"rustc version 1.81.0-dev"}
!514 = !{!"clang version 18.1.7 (https://github.com/llvm/llvm-project.git 8c0fe0d65ed85966c0ac075e896620c55ca95227)"}
!515 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !516, producer: "clang LLVM (rustc version 1.81.0-dev)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !517, globals: !618, splitDebugInlining: false, nameTableKind: None)
!516 = !DIFile(filename: "src/main.rs/@/85a5h6kf4zhdgyraidtyb4v6r", directory: "/home/zjac281/Desktop/RustMC/genmc_for_rust/rust_benchmark/mixed_codebases/racy_test")
!517 = !{!407, !518, !526, !531, !537, !604, !611}
!518 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !519, file: !2, baseType: !89, size: 8, align: 8, flags: DIFlagEnumClass, elements: !521)
!519 = !DINamespace(name: "rt", scope: !520)
!520 = !DINamespace(name: "fmt", scope: !21)
!521 = !{!522, !523, !524, !525}
!522 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!523 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!524 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!525 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!526 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !527, file: !2, baseType: !89, size: 8, align: 8, flags: DIFlagEnumClass, elements: !528)
!527 = !DINamespace(name: "ffi", scope: !21)
!528 = !{!529, !530}
!529 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!530 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!531 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !532, file: !2, baseType: !89, size: 8, align: 8, flags: DIFlagEnumClass, elements: !533)
!532 = !DINamespace(name: "panicking", scope: !21)
!533 = !{!534, !535, !536}
!534 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!535 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!536 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!537 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !538, file: !2, baseType: !140, size: 64, align: 64, flags: DIFlagEnumClass, elements: !539)
!538 = !DINamespace(name: "alignment", scope: !37)
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603}
!540 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!541 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!542 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!543 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!544 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!545 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!546 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!547 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!548 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!549 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!550 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!551 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!552 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!553 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!554 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!555 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!556 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!557 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!558 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!559 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!560 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!561 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!562 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!563 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!564 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!565 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!566 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!567 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!568 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!569 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!570 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!571 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!572 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!573 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!574 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!575 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!576 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!577 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!578 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!579 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!580 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!581 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!582 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!583 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!584 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!585 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!586 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!587 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!588 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!589 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!590 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!591 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!592 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!593 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!594 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!595 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!596 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!597 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!598 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!599 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!600 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!601 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!602 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!603 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!604 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !45, file: !2, baseType: !89, size: 8, align: 8, flags: DIFlagEnumClass, elements: !605)
!605 = !{!606, !607, !608, !609, !610}
!606 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!607 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!608 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!609 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!610 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!611 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !612, file: !2, baseType: !613, size: 8, align: 8, flags: DIFlagEnumClass, elements: !614)
!612 = !DINamespace(name: "cmp", scope: !21)
!613 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!614 = !{!615, !616, !617}
!615 = !DIEnumerator(name: "Less", value: -1)
!616 = !DIEnumerator(name: "Equal", value: 0)
!617 = !DIEnumerator(name: "Greater", value: 1)
!618 = !{!0, !368, !483, !493, !504}
!619 = !{i32 8, !"PIC Level", i32 2}
!620 = !{i32 7, !"PIE Level", i32 2}
!621 = !{i32 2, !"RtLibUseGOT", i32 1}
!622 = !{i32 2, !"Dwarf Version", i32 4}
!623 = !{i32 2, !"Debug Info Version", i32 3}
!624 = !{i32 1, !"wchar_size", i32 4}
!625 = !{i32 7, !"uwtable", i32 2}
!626 = !{i32 7, !"frame-pointer", i32 2}
!627 = distinct !DISubprogram(name: "start", scope: !157, file: !628, line: 16, type: !629, scopeLine: 16, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !515, templateParams: !27, retainedNodes: !633)
!628 = !DIFile(filename: "src/main.rs", directory: "/home/zjac281/Desktop/RustMC/genmc_for_rust/rust_benchmark/mixed_codebases/racy_test", checksumkind: CSK_MD5, checksum: "3039300992061c6076bcbd02d96371cb")
!629 = !DISubroutineType(types: !630)
!630 = !{!631, !631, !632}
!631 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !111, size: 64, align: 64, dwarfAddressSpace: 0)
!633 = !{!634, !635}
!634 = !DILocalVariable(name: "_argc", arg: 1, scope: !627, file: !628, line: 16, type: !631)
!635 = !DILocalVariable(name: "_argv", arg: 2, scope: !627, file: !628, line: 16, type: !632)
!636 = !DILocation(line: 16, column: 10, scope: !627)
!637 = !DILocation(line: 16, column: 24, scope: !627)
!638 = !DILocation(line: 17, column: 5, scope: !627)
!639 = !DILocation(line: 19, column: 2, scope: !627)
!640 = distinct !DISubprogram(name: "main", scope: !157, file: !628, line: 23, type: !641, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !515, templateParams: !27)
!641 = !DISubroutineType(types: !642)
!642 = !{!400}
!643 = !DILocation(line: 25, column: 5, scope: !640)
!644 = !DILocation(line: 29, column: 7, scope: !640)
!645 = !DILocation(line: 32, column: 2, scope: !640)
!646 = distinct !DISubprogram(name: "spawn<racy_test::main::{closure_env#0}, ()>", linkageName: "_ZN3std6thread5spawn17h25d466f67fc2fc9fE", scope: !15, file: !647, line: 692, type: !648, scopeLine: 692, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !515, templateParams: !666, retainedNodes: !664)
!647 = !DIFile(filename: "/home/zjac281/Desktop/RustMC/rust/library/std/src/thread/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "1a5b3f9117025ca051158f067ad894a9")
!648 = !DISubroutineType(types: !649)
!649 = !{!650, !155}
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "JoinHandle<()>", scope: !15, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !651, templateParams: !359, identifier: "2bd458b3c8e05a1caf0fb22bafe72a30")
!651 = !{!652}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !650, file: !2, baseType: !653, size: 192, align: 64, flags: DIFlagPrivate)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "JoinInner<()>", scope: !15, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !654, templateParams: !359, identifier: "2396b206eb504e8f661dafd83cc9e04e")
!654 = !{!655, !662, !663}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "native", scope: !653, file: !2, baseType: !656, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Thread", scope: !657, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !660, templateParams: !27, identifier: "c72e0e83d9764c70ff5f51496b2e5a32")
!657 = !DINamespace(name: "thread", scope: !658)
!658 = !DINamespace(name: "unix", scope: !659)
!659 = !DINamespace(name: "pal", scope: !66)
!660 = !{!661}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !656, file: !2, baseType: !140, size: 64, align: 64, flags: DIFlagPrivate)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !653, file: !2, baseType: !202, size: 64, align: 64, flags: DIFlagPrivate)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "packet", scope: !653, file: !2, baseType: !161, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!664 = !{!665}
!665 = !DILocalVariable(name: "f", arg: 1, scope: !646, file: !647, line: 692, type: !155)
!666 = !{!667, !317}
!667 = !DITemplateTypeParameter(name: "F", type: !155)
!668 = !DILocation(line: 692, column: 20, scope: !646)
!669 = !DILocalVariable(name: "f", arg: 2, scope: !670, file: !647, line: 400, type: !155)
!670 = distinct !DILexicalBlock(scope: !671, file: !647, line: 400, column: 5)
!671 = distinct !DISubprogram(name: "spawn<racy_test::main::{closure_env#0}, ()>", linkageName: "_ZN3std6thread7Builder5spawn17h8dd791878fe4aec1E", scope: !672, file: !647, line: 400, type: !704, scopeLine: 400, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !515, templateParams: !666, declaration: !722, retainedNodes: !723)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Builder", scope: !15, file: !2, size: 320, align: 8, flags: DIFlagPublic, elements: !673, templateParams: !27, identifier: "fc5e6cda4d9760506ff90c97733145b0")
!673 = !{!674, !692}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !672, file: !2, baseType: !675, size: 192, align: 64, offset: 128, flags: DIFlagPrivate)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::string::String>", scope: !20, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !676, templateParams: !27, identifier: "35d87c8995e3c4a4ce1b05bb7decfdd6")
!676 = !{!677}
!677 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !675, file: !2, size: 192, align: 64, elements: !678, templateParams: !27, identifier: "999e06b566e286749cd023d8bad45dd7", discriminator: !691)
!678 = !{!679, !687}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !677, file: !2, baseType: !680, size: 192, align: 64, extraData: i128 9223372036854775808)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !675, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !681, identifier: "1654e9770c137127523a94e573552d2")
!681 = !{!682}
!682 = !DITemplateTypeParameter(name: "T", type: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !684, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !685, templateParams: !27, identifier: "b679994d5176e053cade945d3de26b79")
!684 = !DINamespace(name: "string", scope: !32)
!685 = !{!686}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !683, file: !2, baseType: !96, size: 192, align: 64, flags: DIFlagPrivate)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !677, file: !2, baseType: !688, size: 192, align: 64)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !675, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !689, templateParams: !681, identifier: "5bb0e1ed178cdba0f14f92a99e9a6d74")
!689 = !{!690}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !688, file: !2, baseType: !683, size: 192, align: 64, flags: DIFlagPublic)
!691 = !DIDerivedType(tag: DW_TAG_member, scope: !675, file: !2, baseType: !140, size: 64, align: 64, flags: DIFlagArtificial)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !672, file: !2, baseType: !693, size: 128, align: 64, flags: DIFlagPrivate)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !20, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !694, templateParams: !27, identifier: "afdf05a350f1fb0b2dffae10e66e2ada")
!694 = !{!695}
!695 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !693, file: !2, size: 128, align: 64, elements: !696, templateParams: !27, identifier: "ae631cf7ae85aac2a46519f3569192fb", discriminator: !703)
!696 = !{!697, !699}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !695, file: !2, baseType: !698, size: 128, align: 64, extraData: i128 0)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !693, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !53, identifier: "5315b19b46731d5cffadb54cb91e49a4")
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !695, file: !2, baseType: !700, size: 128, align: 64, extraData: i128 1)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !693, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !701, templateParams: !53, identifier: "f83e258083f12c8a354344c27ad99835")
!701 = !{!702}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !700, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!703 = !DIDerivedType(tag: DW_TAG_member, scope: !693, file: !2, baseType: !140, size: 64, align: 64, flags: DIFlagArtificial)
!704 = !DISubroutineType(types: !705)
!705 = !{!706, !672, !155}
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Result<std::thread::JoinHandle<()>, std::io::error::Error>", scope: !308, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !707, templateParams: !27, identifier: "e063dac4e9b028554aa7e3da070e1db")
!707 = !{!708}
!708 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !706, file: !2, size: 192, align: 64, elements: !709, templateParams: !27, identifier: "bb83297df4801c5cc5d01f94d9a9ecb5", discriminator: !721)
!709 = !{!710, !717}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !708, file: !2, baseType: !711, size: 192, align: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !706, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !712, templateParams: !714, identifier: "605abacf8f7001bc75a0508144f650d")
!712 = !{!713}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !711, file: !2, baseType: !650, size: 192, align: 64, flags: DIFlagPublic)
!714 = !{!715, !716}
!715 = !DITemplateTypeParameter(name: "T", type: !650)
!716 = !DITemplateTypeParameter(name: "E", type: !376)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !708, file: !2, baseType: !718, size: 192, align: 64, extraData: i128 0)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !706, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !719, templateParams: !714, identifier: "ab41b7c7ca4b9f05805e221f1e897d1f")
!719 = !{!720}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !718, file: !2, baseType: !376, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!721 = !DIDerivedType(tag: DW_TAG_member, scope: !706, file: !2, baseType: !140, size: 64, align: 64, flags: DIFlagArtificial)
!722 = !DISubprogram(name: "spawn<racy_test::main::{closure_env#0}, ()>", linkageName: "_ZN3std6thread7Builder5spawn17h8dd791878fe4aec1E", scope: !672, file: !647, line: 400, type: !704, scopeLine: 400, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !666)
!723 = !{!724, !669}
!724 = !DILocalVariable(name: "self", arg: 1, scope: !670, file: !647, line: 400, type: !672)
!725 = !DILocation(line: 400, column: 30, scope: !670, inlinedAt: !726)
!726 = !DILocation(line: 698, column: 20, scope: !646)
!727 = !DILocation(line: 400, column: 24, scope: !670, inlinedAt: !726)
!728 = !DILocation(line: 307, column: 25, scope: !729, inlinedAt: !734)
!729 = distinct !DILexicalBlock(scope: !730, file: !647, line: 306, column: 5)
!730 = distinct !DISubprogram(name: "new", linkageName: "_ZN3std6thread7Builder3new17h1f71c7bbb7ef531bE", scope: !672, file: !647, line: 306, type: !731, scopeLine: 306, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !515, templateParams: !27, declaration: !733)
!731 = !DISubroutineType(types: !732)
!732 = !{!672}
!733 = !DISubprogram(name: "new", linkageName: "_ZN3std6thread7Builder3new17h1f71c7bbb7ef531bE", scope: !672, file: !647, line: 306, type: !731, scopeLine: 306, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !27)
!734 = !DILocation(line: 698, column: 5, scope: !646)
!735 = !DILocation(line: 307, column: 9, scope: !729, inlinedAt: !734)
!736 = !DILocation(line: 406, column: 18, scope: !670, inlinedAt: !726)
!737 = !DILocation(line: 699, column: 2, scope: !646)
!738 = distinct !DISubprogram(name: "drop_in_place<std::thread::JoinHandle<()>>", linkageName: "_ZN4core3ptr60drop_in_place$LT$std..thread..JoinHandle$LT$$LP$$RP$$GT$$GT$17h7c11485a5182e9e7E", scope: !37, file: !739, line: 543, type: !740, scopeLine: 543, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !515, templateParams: !745, retainedNodes: !743)
!739 = !DIFile(filename: "/home/zjac281/Desktop/RustMC/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "818c4d94296c75435e0ad8eaaf5f8e2f")
!740 = !DISubroutineType(types: !741)
!741 = !{null, !742}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::thread::JoinHandle<()>", baseType: !650, size: 64, align: 64, dwarfAddressSpace: 0)
!743 = !{!744}
!744 = !DILocalVariable(arg: 1, scope: !738, file: !739, line: 543, type: !742)
!745 = !{!715}
!746 = !DILocation(line: 543, column: 1, scope: !738)
!747 = distinct !DISubprogram(name: "drop_in_place<std::thread::JoinInner<()>>", linkageName: "_ZN4core3ptr59drop_in_place$LT$std..thread..JoinInner$LT$$LP$$RP$$GT$$GT$17hec608f2f0614fe83E", scope: !37, file: !739, line: 543, type: !748, scopeLine: 543, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !515, templateParams: !753, retainedNodes: !751)
!748 = !DISubroutineType(types: !749)
!749 = !{null, !750}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::thread::JoinInner<()>", baseType: !653, size: 64, align: 64, dwarfAddressSpace: 0)
!751 = !{!752}
!752 = !DILocalVariable(arg: 1, scope: !747, file: !739, line: 543, type: !750)
!753 = !{!754}
!754 = !DITemplateTypeParameter(name: "T", type: !653)
!755 = !DILocation(line: 543, column: 1, scope: !747)
!756 = distinct !DISubprogram(name: "drop_in_place<std::sys::pal::unix::thread::Thread>", linkageName: "_ZN4core3ptr56drop_in_place$LT$std..sys..pal..unix..thread..Thread$GT$17h618d7cb71fed3dccE", scope: !37, file: !739, line: 543, type: !757, scopeLine: 543, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !515, templateParams: !762, retainedNodes: !760)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !759}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::sys::pal::unix::thread::Thread", baseType: !656, size: 64, align: 64, dwarfAddressSpace: 0)
!760 = !{!761}
!761 = !DILocalVariable(arg: 1, scope: !756, file: !739, line: 543, type: !759)
!762 = !{!763}
!763 = !DITemplateTypeParameter(name: "T", type: !656)
!764 = !DILocation(line: 543, column: 1, scope: !756)
!765 = distinct !DISubprogram(name: "drop_in_place<std::thread::Thread>", linkageName: "_ZN4core3ptr40drop_in_place$LT$std..thread..Thread$GT$17h4710cefd6a51ca9eE", scope: !37, file: !739, line: 543, type: !766, scopeLine: 543, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !515, templateParams: !771, retainedNodes: !769)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !768}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::thread::Thread", baseType: !202, size: 64, align: 64, dwarfAddressSpace: 0)
!769 = !{!770}
!770 = !DILocalVariable(arg: 1, scope: !765, file: !739, line: 543, type: !768)
!771 = !{!772}
!772 = !DITemplateTypeParameter(name: "T", type: !202)
!773 = !DILocation(line: 543, column: 1, scope: !765)
!774 = distinct !DISubprogram(name: "drop_in_place<alloc::sync::Arc<std::thread::Packet<()>, alloc::alloc::Global>>", linkageName: "_ZN4core3ptr80drop_in_place$LT$alloc..sync..Arc$LT$std..thread..Packet$LT$$LP$$RP$$GT$$GT$$GT$17h9fbb0c71a37ba120E", scope: !37, file: !739, line: 543, type: !775, scopeLine: 543, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !515, templateParams: !780, retainedNodes: !778)
!775 = !DISubroutineType(types: !776)
!776 = !{null, !777}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut alloc::sync::Arc<std::thread::Packet<()>, alloc::alloc::Global>", baseType: !161, size: 64, align: 64, dwarfAddressSpace: 0)
!778 = !{!779}
!779 = !DILocalVariable(arg: 1, scope: !774, file: !739, line: 543, type: !777)
!780 = !{!781}
!781 = !DITemplateTypeParameter(name: "T", type: !161)
!782 = !DILocation(line: 543, column: 1, scope: !774)
!783 = distinct !DISubprogram(name: "drop<std::thread::Packet<()>, alloc::alloc::Global>", linkageName: "_ZN71_$LT$alloc..sync..Arc$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17h1f789e45d55dee25E", scope: !785, file: !784, line: 2486, type: !786, scopeLine: 2486, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !515, templateParams: !367, retainedNodes: !789)
!784 = !DIFile(filename: "/home/zjac281/Desktop/RustMC/rust/library/alloc/src/sync.rs", directory: "", checksumkind: CSK_MD5, checksum: "87aed2761fdceae60e1856042fb210ee")
!785 = !DINamespace(name: "{impl#35}", scope: !31)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !788}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::sync::Arc<std::thread::Packet<()>, alloc::alloc::Global>", baseType: !161, size: 64, align: 64, dwarfAddressSpace: 0)
!789 = !{!790}
!790 = !DILocalVariable(name: "self", arg: 1, scope: !783, file: !784, line: 2486, type: !788)
!791 = !DILocation(line: 2701, column: 37, scope: !792, inlinedAt: !803)
!792 = distinct !DILexicalBlock(scope: !794, file: !793, line: 2701, column: 13)
!793 = !DIFile(filename: "/home/zjac281/Desktop/RustMC/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "864d8958f8cfcfda0a9f2974834e1e2f")
!794 = distinct !DISubprogram(name: "fetch_sub", linkageName: "_ZN4core4sync6atomic11AtomicUsize9fetch_sub17hd0bf870d675ecb9eE", scope: !44, file: !793, line: 2701, type: !795, scopeLine: 2701, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !515, templateParams: !27, declaration: !798, retainedNodes: !799)
!795 = !DISubroutineType(types: !796)
!796 = !{!9, !797, !9, !604}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !44, size: 64, align: 64, dwarfAddressSpace: 0)
!798 = !DISubprogram(name: "fetch_sub", linkageName: "_ZN4core4sync6atomic11AtomicUsize9fetch_sub17hd0bf870d675ecb9eE", scope: !44, file: !793, line: 2701, type: !795, scopeLine: 2701, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !27)
!799 = !{!800, !801, !802}
!800 = !DILocalVariable(name: "self", arg: 1, scope: !792, file: !793, line: 2701, type: !797)
!801 = !DILocalVariable(name: "val", scope: !792, file: !793, line: 2701, type: !9, align: 8)
!802 = !DILocalVariable(name: "order", scope: !792, file: !793, line: 2701, type: !604, align: 1)
!803 = !DILocation(line: 2490, column: 32, scope: !783)
!804 = !DILocation(line: 2701, column: 53, scope: !792, inlinedAt: !803)
!805 = !DILocation(line: 3359, column: 44, scope: !806, inlinedAt: !815)
!806 = distinct !DILexicalBlock(scope: !807, file: !793, line: 3359, column: 1)
!807 = distinct !DISubprogram(name: "atomic_sub<usize>", linkageName: "_ZN4core4sync6atomic10atomic_sub17h21fc3523be2d24e8E", scope: !45, file: !793, line: 3359, type: !808, scopeLine: 3359, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !515, templateParams: !53, retainedNodes: !811)
!808 = !DISubroutineType(types: !809)
!809 = !{!9, !810, !9, !604}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!811 = !{!812, !813, !814}
!812 = !DILocalVariable(name: "dst", arg: 1, scope: !806, file: !793, line: 3359, type: !810)
!813 = !DILocalVariable(name: "val", scope: !806, file: !793, line: 3359, type: !9, align: 8)
!814 = !DILocalVariable(name: "order", scope: !806, file: !793, line: 3359, type: !604, align: 1)
!815 = !DILocation(line: 2703, column: 26, scope: !792, inlinedAt: !803)
!816 = !DILocation(line: 3359, column: 52, scope: !806, inlinedAt: !815)
!817 = !DILocation(line: 3652, column: 14, scope: !818, inlinedAt: !824)
!818 = distinct !DILexicalBlock(scope: !819, file: !793, line: 3652, column: 1)
!819 = distinct !DISubprogram(name: "fence", linkageName: "_ZN4core4sync6atomic5fence17hfcf6e58708dac97aE", scope: !45, file: !793, line: 3652, type: !820, scopeLine: 3652, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !515, templateParams: !27, retainedNodes: !822)
!820 = !DISubroutineType(types: !821)
!821 = !{null, !604}
!822 = !{!823}
!823 = !DILocalVariable(name: "order", scope: !818, file: !793, line: 3652, type: !604, align: 1)
!824 = !DILocation(line: 64, column: 9, scope: !783)
!825 = !DILocation(line: 340, column: 44, scope: !826, inlinedAt: !957)
!826 = distinct !DILexicalBlock(scope: !828, file: !827, line: 340, column: 5)
!827 = !DIFile(filename: "/home/zjac281/Desktop/RustMC/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "5e06e2bf7277c988ac65c855c0bf208e")
!828 = distinct !DISubprogram(name: "new_const<1>", linkageName: "_ZN4core3fmt9Arguments9new_const17ha0db060053364927E", scope: !829, file: !827, line: 340, type: !946, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !515, templateParams: !27, declaration: !952, retainedNodes: !953)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !520, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !830, templateParams: !27, identifier: "33e7ab579c1d09ad6a433109cfb5a7c5")
!830 = !{!831, !837, !880}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !829, file: !2, baseType: !832, size: 128, align: 64, flags: DIFlagPrivate)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !833, templateParams: !27, identifier: "4e66b00a376d6af5b8765440fb2839f")
!833 = !{!834, !836}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !832, file: !2, baseType: !835, size: 64, align: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64, dwarfAddressSpace: 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !832, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !829, file: !2, baseType: !838, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !20, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !839, templateParams: !27, identifier: "9e63b088d44b6345b52463526db4ca8d")
!839 = !{!840}
!840 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !838, file: !2, size: 128, align: 64, elements: !841, templateParams: !27, identifier: "7f02ab499ddae09baa06c83974f510d1", discriminator: !879)
!841 = !{!842, !875}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !840, file: !2, baseType: !843, size: 128, align: 64, extraData: i128 0)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !838, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !844, identifier: "ae26eb3cfb68a901832d0f9dc436af07")
!844 = !{!845}
!845 = !DITemplateTypeParameter(name: "T", type: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !847, templateParams: !27, identifier: "b7401c83c03e223a95220b83b44cecfe")
!847 = !{!848, !874}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !846, file: !2, baseType: !849, size: 64, align: 64)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64, align: 64, dwarfAddressSpace: 0)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !519, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !851, templateParams: !27, identifier: "5dbbfcb246d8fa33f9321e3419790396")
!851 = !{!852, !853, !855, !856, !857, !873}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !850, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !850, file: !2, baseType: !854, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!854 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !850, file: !2, baseType: !518, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !850, file: !2, baseType: !75, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !850, file: !2, baseType: !858, size: 128, align: 64, flags: DIFlagPublic)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !519, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !859, templateParams: !27, identifier: "4744b8400eac5c572574a0613bbad44d")
!859 = !{!860}
!860 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !858, file: !2, size: 128, align: 64, elements: !861, templateParams: !27, identifier: "f1a4c01c6c0963d95a8e201aeb9ecbdb", discriminator: !872)
!861 = !{!862, !866, !870}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !860, file: !2, baseType: !863, size: 128, align: 64, extraData: i128 0)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !858, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !864, templateParams: !27, identifier: "a0a5fa6b7626b961b1363f0b114fb9cb")
!864 = !{!865}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !863, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !860, file: !2, baseType: !867, size: 128, align: 64, extraData: i128 1)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !858, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !868, templateParams: !27, identifier: "1e809001fef28c0a931b8fd3818c8823")
!868 = !{!869}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !867, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !860, file: !2, baseType: !871, size: 128, align: 64, extraData: i128 2)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !858, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !27, identifier: "9ebefe61e45c2a169ed2d3306336d22")
!872 = !DIDerivedType(tag: DW_TAG_member, scope: !858, file: !2, baseType: !140, size: 64, align: 64, flags: DIFlagArtificial)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !850, file: !2, baseType: !858, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !846, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !840, file: !2, baseType: !876, size: 128, align: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !838, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !877, templateParams: !844, identifier: "e66aab0b9e54862be85e5742bdcefbd6")
!877 = !{!878}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !876, file: !2, baseType: !846, size: 128, align: 64, flags: DIFlagPublic)
!879 = !DIDerivedType(tag: DW_TAG_member, scope: !838, file: !2, baseType: !140, size: 64, align: 64, flags: DIFlagArtificial)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !829, file: !2, baseType: !881, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !882, templateParams: !27, identifier: "1e78434aa3533434e1575d0346e506a1")
!882 = !{!883, !945}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !881, file: !2, baseType: !884, size: 64, align: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64, align: 64, dwarfAddressSpace: 0)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !519, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !886, templateParams: !27, identifier: "6e13d16d5d6ac8f8863f4faaccbb8495")
!886 = !{!887}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !885, file: !2, baseType: !888, size: 128, align: 64, flags: DIFlagPrivate)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentType", scope: !519, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !889, templateParams: !27, identifier: "da2603ef694e409c624c541510d9a4f8")
!889 = !{!890}
!890 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !888, file: !2, size: 128, align: 64, elements: !891, templateParams: !27, identifier: "2ef502219a75267f992ee348b1b9511d", discriminator: !944)
!891 = !{!892, !940}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "Placeholder", scope: !890, file: !2, baseType: !893, size: 128, align: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !888, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !894, templateParams: !27, identifier: "d8eb32ffbcb1d9d4eb6d81c9c66fa5e8")
!894 = !{!895, !896, !935}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !893, file: !2, baseType: !385, size: 64, align: 64, flags: DIFlagPrivate)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !893, file: !2, baseType: !897, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(core::ptr::non_null::NonNull<()>, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !898, size: 64, align: 64, dwarfAddressSpace: 0)
!898 = !DISubroutineType(types: !899)
!899 = !{!900, !385, !916}
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !308, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !901, templateParams: !27, identifier: "7b890e629e8003be4ac459d7d9f43602")
!901 = !{!902}
!902 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !900, file: !2, size: 8, align: 8, elements: !903, templateParams: !27, identifier: "c6c1460531f61b241801bb19335b45d0", discriminator: !915)
!903 = !{!904, !911}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !902, file: !2, baseType: !905, size: 8, align: 8, extraData: i128 0)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !900, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !906, templateParams: !908, identifier: "450ceb53a5463e18ceda0f8144347e8d")
!906 = !{!907}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !905, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!908 = !{!317, !909}
!909 = !DITemplateTypeParameter(name: "E", type: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !520, file: !2, align: 8, flags: DIFlagPublic, elements: !27, identifier: "bea952f45358d99aadc931903ebad378")
